In [1]:
import pandas as pd

In [6]:
s1 = pd.Series([71, 84, 56, 23, 56, 98, 56])

In [7]:
s1

0    71
1    84
2    56
3    23
4    56
5    98
6    56
dtype: int64

In [8]:
type(s1)

pandas.core.series.Series

In [9]:
s2 = pd.Series([71, 84, 56, 23, 56, 98, 56], index=["Mili", "siya", "ras", "man", "sam", "riya", "neha"])

In [10]:
s2

Mili    71
siya    84
ras     56
man     23
sam     56
riya    98
neha    56
dtype: int64

In [11]:
s2["Mili"]

np.int64(71)

In [13]:
data = {
    "name" :["Mili", "Neha", "Riya"],
    "age": [20, 23, 21],
    "city": ["Pune", "Delhi", "Mumbai"]
    }

In [15]:
df = pd.DataFrame(data)

In [16]:
df

   name  age    city
0  Mili   20    Pune
1  Neha   23   Delhi
2  Riya   21  Mumbai

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df.columns

Index(['name', 'age', 'city'], dtype='object')